/*----------------------------------------------------------------------------
Real-world sample gathered for lexer validation (not written for this project).
Source: https://github.com/zowe/zowe-pli-language-support/blob/development/code_samples/PDUMP/SETUPL.pli
Project: Zowe PL/I Language Support (IBM/Zowe's real-world PL/I
         language-server tooling project; per its own code_samples/
         README, sourced from IBM PL/I for z/OS V6.1/6.2 with the IBA
         Group Enterprise PL/I compiler)
License: Eclipse Public License 2.0 (EPL-2.0). Retained here under
         those terms as part of pygments-extensions' own real-world
         lexer validation corpus; see samples/pli/real-world/README.md.
----------------------------------------------------------------------------*/
1SETUPL: PROCEDURE(KY,##,PR) REORDER;                                   00010000
    DECLARE                                                             00020000
      KY                 FIXED BIN(15,0),                               00030000
      ##                 FIXED BIN(15,0),                               00040000
      PR                 CHAR(*) VARYING;                               00050000
    S99TUPL(S99TUPL#) = ADDR(KEY(S99TUPL#));                            00060000
    KEY(S99TUPL#)  = KY;                                                00070000
    #(S99TUPL#)    = ##;                                                00080000
    PARM(S99TUPL#) = PR;                                                00090000
 END SETUPL;                                                            00100000
