/*----------------------------------------------------------------------------
Real-world sample gathered for lexer validation (not written for this project).
Source: https://github.com/zowe/zowe-pli-language-support/blob/development/code_samples/PTASKTS.pli
Project: Zowe PL/I Language Support (IBM/Zowe's real-world PL/I
         language-server tooling project; per its own code_samples/
         README, sourced from IBM PL/I for z/OS V6.1/6.2 with the IBA
         Group Enterprise PL/I compiler)
License: Eclipse Public License 2.0 (EPL-2.0). Retained here under
         those terms as part of pygments-extensions' own real-world
         lexer validation corpus; see samples/pli/real-world/README.md.
----------------------------------------------------------------------------*/
 /* ************************************************************** */
 /* PGM: PTASKTS  - WORK WITH TEMPORARY STORAGE QUEUE - TSQ        */
 /* ************************************************************** */
 /* IT WRITES A LIST OF EMPLOYEES OF THE SECTOR ESI INTO TSQ 'OLGA'*/
 /* FORMAT:                                                        */
 /* EMPLOYEE : SURNAME NAME, PHONE : PHONE                         */
 /* ************************************************************** */
 PTASKTS:  PROC OPTIONS(MAIN) REORDER ;
  EXEC CICS IGNORE CONDITION LENGERR;
  EXEC CICS IGNORE CONDITION QZERO ;
  DCL
  1 R404_RECORD           ,                    /* ROOM 404 RECORD */
    2 STATUS     CHAR(1)  ,
    2 EMPL                ,
      3 SURNAME  CHAR(14) ,
      3 NAME     CHAR(11) ,
    2 GENDER     CHAR(1)  ,
    2 SECTOR     CHAR(8)  ,
    2 PHONE      CHAR(4)  ,
    2 BOSS                ,
      3 SURNAME  CHAR(14) ,
      3 NAME     CHAR(11) ;
  R404_RECORD = '' ;
  DCL RESI_RECORD CHAR(50) ;                /* OUT RECORD FOR TSQ */
  RESI_RECORD = '' ;
  EXEC CICS SET TDQUEUE('R404') OPEN ;
  EXEC CICS READQ TD QUEUE('R404') INTO (R404_RECORD) ;
                               /*     WHILE TDQ IS NOT EMPTY      */
  DO WHILE(EIBRESP ^= DFHRESP(QZERO) &
           EIBRESP = DFHRESP(NORMAL)) ;
    IF R404_RECORD.SECTOR = 'ESI     '
      THEN DO ;
        RESI_RECORD = 'EMPLOYEE : '|| R404_RECORD.EMPL.SURNAME ||
                      R404_RECORD.EMPL.NAME || ', ' ||
                      'PHONE : '|| R404_RECORD.PHONE ;
        EXEC CICS WRITEQ TS QUEUE('OLGA') FROM (RESI_RECORD) ;
      END ;
    IF EIBRESP = DFHRESP(NORMAL) THEN
    EXEC CICS READQ TD QUEUE('R404') INTO (R404_RECORD) ;
  END ;
  EXEC CICS SET TDQUEUE('R404') CLOSED ;
  EXEC CICS RETURN ;
 END PTASKTS  ;