/*----------------------------------------------------------------------------
Real-world sample gathered for lexer validation (not written for this project).
Source: https://github.com/zowe/zowe-pli-language-support/blob/development/code_samples/PDUMP/NUM.pli
Project: Zowe PL/I Language Support (IBM/Zowe's real-world PL/I
         language-server tooling project; per its own code_samples/
         README, sourced from IBM PL/I for z/OS V6.1/6.2 with the IBA
         Group Enterprise PL/I compiler)
License: Eclipse Public License 2.0 (EPL-2.0). Retained here under
         those terms as part of pygments-extensions' own real-world
         lexer validation corpus; see samples/pli/real-world/README.md.
----------------------------------------------------------------------------*/
-NUM: PROCEDURE(ST,LN) RETURNS(CHAR(3) VARYING) REORDER;                00010000
    DECLARE                                                             00020000
      ST                 CHAR(*) VARYING,                               00030000
      LN                 FIXED BIN(15,0),                               00040000
      NM                 FIXED BIN(31,0) INIT(0),                       00050000
      STR                CHAR(3) VARYING INIT('');                      00060000
    NM = ST;                                                            00070000
    STR = SUBSTR('   ',1,LN);                                           00080000
    UNSPEC(STR) = UNSPEC(LN) || SUBSTR(UNSPEC(NM),33-8*LN);             00090000
    RETURN(STR);                                                        00100000
 END NUM;                                                               00110000
