/*----------------------------------------------------------------------------
Real-world sample gathered for lexer validation (not written for this project).
Source: https://github.com/zowe/zowe-pli-language-support/blob/development/code_samples/DB2VRM.pli
Project: Zowe PL/I Language Support (IBM/Zowe's real-world PL/I
         language-server tooling project; per its own code_samples/
         README, sourced from IBM PL/I for z/OS V6.1/6.2 with the IBA
         Group Enterprise PL/I compiler)
License: Eclipse Public License 2.0 (EPL-2.0). Retained here under
         those terms as part of pygments-extensions' own real-world
         lexer validation corpus; see samples/pli/real-world/README.md.
----------------------------------------------------------------------------*/
 /*********************************************************************/
 /* MODULE NAME  : DB2TEST                                            */
 /* FUNCTION     : THIS PROGRAM GET DB2 VERSION                       */
 /*********************************************************************/
 MAIN: PROC OPTIONS(MAIN) REORDER;
 DCL SYSPRINT FILE EXT PRINT;
 DCL DB2VRM VAR CHAR(20);
 EXEC SQL INCLUDE SQLCA; /* INCLUDE COMMUNICATION AREA */
 EXEC SQL WHENEVER SQLWARNING CONTINUE;
 EXEC SQL WHENEVER SQLERROR CONTINUE;
 EXEC SQL WHENEVER NOT FOUND CONTINUE;
 EXEC SQL DECLARE C CURSOR FOR
     SELECT GETVARIABLE('SYSIBM.VERSION') FROM SYSIBM.SYSDUMMY1;
 EXEC SQL OPEN C;
 PUT SKIP LIST('OPEN CURSOR '||SQLCODE);
 EXEC SQL FETCH C INTO :DB2VRM;
 PUT SKIP LIST('FETCH CURSOR '||SQLCODE);
 PUT SKIP LIST('DB2 VERSION '||DB2VRM);
 RC = 0;
 CALL PLIRETC(RC);
 END MAIN;