/*----------------------------------------------------------------------------
Real-world sample gathered for lexer validation (not written for this project).
Source: https://github.com/zowe/zowe-pli-language-support/blob/development/code_samples/PTASK32.pli
Project: Zowe PL/I Language Support (IBM/Zowe's real-world PL/I
         language-server tooling project; per its own code_samples/
         README, sourced from IBM PL/I for z/OS V6.1/6.2 with the IBA
         Group Enterprise PL/I compiler)
License: Eclipse Public License 2.0 (EPL-2.0). Retained here under
         those terms as part of pygments-extensions' own real-world
         lexer validation corpus; see samples/pli/real-world/README.md.
----------------------------------------------------------------------------*/
 PTASK32: PROC OPTIONS(MAIN) REORDER ;
  EXEC CICS HANDLE CONDITION ERROR;
  EXEC CICS IGNORE CONDITION
            ENQBUSY
            FILENOTFOUND
            NOTFND
            NOTOPEN
            DUPKEY
            ENDFILE
            LENGERR
            DUPREC
            NOSPACE
            INVREQ
            ITEMERR
            QIDERR
            PGMIDERR
            IOERR ;
  DCL
  1 R404_RECORD  ,                       /* ROOM 404 RECORD         */
    2 STATUS     CHAR(1)  ,
    2 EMPL     ,
      3 SURNAME  CHAR(14) ,
      3 NAME     CHAR(11) ,
    2 GENDER     CHAR(1) ,
    2 SECTOR     CHAR(8) ,
    2 PHONE      CHAR(4) ,
    2 BOSS ,
      3 SURNAME  CHAR(14) ,
      3 NAME     CHAR(11) ;
  R404_RECORD = '' ;
  DCL REC_KEY    CHAR(14) INIT('');
  REC_KEY = 'BROUKA        ';            /*  TO PREPARE THE KEY     */
  EXEC CICS READ FILE('VSR404') INTO(R404_RECORD)
            RIDFLD(REC_KEY) UPDATE;
  IF EIBRESP ^= DFHRESP(NORMAL) THEN
    DO ;
      /* TO WRITE A MESSOGE ABOUT ERROR     */
      /* EIBRESP  = ...                     */
      EXEC CICS RETURN ;
    END ;
  ELSE  ;
    DO ;
      R404_RECORD.PHONE ='1111' ;            /* TO REPLACE WITH  .. */
      EXEC CICS REWRITE FILE('VSR404') FROM(R404_RECORD) ;
      EXEC CICS RETURN ;
    END ;
 END PTASK32;