/*----------------------------------------------------------------------------
Real-world sample gathered for lexer validation (not written for this project).
Source: https://github.com/zowe/zowe-pli-language-support/blob/development/code_samples/preprocessor/do.pli
Project: Zowe PL/I Language Support (IBM/Zowe's real-world PL/I
         language-server tooling project; per its own code_samples/
         README, sourced from IBM PL/I for z/OS V6.1/6.2 with the IBA
         Group Enterprise PL/I compiler)
License: Eclipse Public License 2.0 (EPL-2.0). Retained here under
         those terms as part of pygments-extensions' own real-world
         lexer validation corpus; see samples/pli/real-world/README.md.
----------------------------------------------------------------------------*/
 /* DO Groups */
 %DCL X FIXED;
 %X = 1;

 %DO
   /* Synthesize 3 new declarations */
   WHILE(X <= 3);
     DCL Variable%;X FIXED;
     %X = X + 1;
 %END;

 /* Reference these new declarations */
 Variable1 = 1;
 Variable2 = 2;
 Variable3 = 3;

 /* But not this one... */
 /* Variable4 = 4; */